views/empresa/view.php

<div class="body-content">
    <ul class="nav nav-tabs">
    <?php
                        $demonstracoes = Demonstracao::find()->select('*')->all();
---
SELECT * FROM `demonstracao`


    <div class="tab-content">
        <?php
                        $demonstracoes = Demonstracao::find()->select('*')->all();
---
SELECT * FROM `demonstracao`

                            <th><input type="checkbox" id="check_all" /></th>
                            <th>Nome Conta: <?=$demonstracao->idDemonstracao?></th>
                            <?php
                                            $anosEmpresas = EmpresaConta::find()->select('ano')->distinct()->orderBy(["ano"=> SORT_ASC])->all();
---
SELECT DISTINCT `ano` FROM `empresa_conta` ORDER BY `ano`

                    </thead>
                    <tbody>
                    <?php
                    $contas = Conta::find()->select('*')->where(['idDemonstracao' => $demonstracao->idDemonstracao])->all();
---
SELECT * FROM `conta` WHERE `idDemonstracao`=1

                            <td><?=$conta->nome?></td>

                               <?php
                                            $anosEmpresas = EmpresaConta::find()->select('ano')->distinct()->orderBy(["ano"=> SORT_ASC])->all();
                                                 $tweets = [['nome'=>'Liquidez', 'id'=>100]];

                                                foreach($anosEmpresas as $anosEmpresa){
                                                    $valoress = EmpresaConta::find()->select('valor')->where(['idConta' => $conta->idConta])->andWhere(['ano' =>$anosEmpresa->ano])->all();
---
SELECT DISTINCT `ano` FROM `empresa_conta` ORDER BY `ano`
SELECT `valor` FROM `empresa_conta` WHERE (`idConta`=4) AND (`ano`=2013)

                            <th><input type="checkbox" id="check_all" /></th>
                            <th>Nome Conta:</th>
                            <?php
                                            $anosEmpresas = EmpresaConta::find()->select('ano')->distinct()->orderBy(["ano"=> SORT_ASC])->all();
---
SELECT DISTINCT `ano` FROM `empresa_conta` ORDER BY `ano`

                    </thead>
                    <tbody>
                    <?php
                    $contas = Conta::find()->select('*')->where(['obrigatorio' =>1])->all();
---
SELECT * FROM `conta` WHERE `obrigatorio`=1

                            <td><?=$conta->nome?></td>

                               <?php
                                            $anosEmpresas = EmpresaConta::find()->select('ano')->distinct()->orderBy(["ano"=> SORT_ASC])->all();

                                                foreach($anosEmpresas as $anosEmpresa){
                                                    $valoress = EmpresaConta::find()->select('valor')->where(['idConta' => $conta->idConta])->andWhere(['ano' =>$anosEmpresa->ano])->all();
---
SELECT DISTINCT `ano` FROM `empresa_conta` ORDER BY `ano`
SELECT `valor` FROM `empresa_conta` WHERE (`idConta`=4) AND (`ano`=2013)

                <div class="container">
                    <ul class="nav nav-tabs">
                    <?php
                        $tipoIndices = TipoIndice::find()->select('*')->all();
---
SELECT * FROM `tipo_indice`


            <div class="tab-content">
                    <?php
                        $tipoIndices = TipoIndice::find()->select('*')->all();
---
SELECT * FROM `tipo_indice`

                                            <th>Fórmula:</th>

                                            <?php
                                            $anosEmpresas = EmpresaConta::find()->select('ano')->distinct()->orderBy(["ano"=> SORT_ASC])->all();
---
SELECT DISTINCT `ano` FROM `empresa_conta` ORDER BY `ano`

                                    </thead>
                                    <tbody>
                                        <?php
                                            $indices = Indice::find()->select('*')->where(['idTipo_indice' => $tipoIndice->idTipo_indice])->all();
---
SELECT * FROM `indice` WHERE `idTipo_indice`=1

                                                 $sinais = ['+', '-', '/', '*', '(', ')'];
                                                    $calculator = new Calculator();
                                                foreach($indices as $indice){
                                                    $indiceIn = Indice::find()->select('*')->where(['idIndice' => $indice->idIndice])->all();
---
SELECT * FROM `indice` WHERE `idIndice`=1

                                                            $montarFormulaAnterior = ' '.$montarFormula.' ';
                                                            $montarFormula=$montarFormulaAnterior.$getChaveContas[$i];
                                                        }else{
                                                            $conta = Conta::find()->select("*")->where(['chave' => $getChaveContas[$i]])->one();
---
SELECT * FROM `conta` WHERE `chave`='#AT'

                                            <td><?=$montarFormula?></td>

                                            <?php
                                                $anosEmpresas = EmpresaConta::find()->select('ano')->distinct()->orderBy(["ano"=> SORT_ASC])->all();
---
SELECT DISTINCT `ano` FROM `empresa_conta` ORDER BY `ano`

                                                                                    $montarFormula=$montarFormulaAnterior.$getChaveContas[$i];

                                                                                }else{
                                                                                    $conta = Conta::find()->select("*")->where(['chave' => $getChaveContas[$i]])->one();
                                                                                    $idConta = $conta['idConta'];
                                                                                    $empresaConta = EmpresaConta::find()->select("*")->where(['idConta' => $idConta])->andWhere(['ano' =>$anosEmpresa->ano])->andWhere(['idEmpresa' =>$model->idEmpresa])->one();
---
SELECT * FROM `conta` WHERE `chave`='#AT'
SELECT * FROM `empresa_conta` WHERE ((`idConta`=4) AND (`ano`=2013)) AND (`idEmpresa`=5)

 <div class="body-content">
    <ul class="nav nav-tabs">
    <?php
                         $analises = Analise::find()->select('ano')->where(['idEmpresa' => $model->idEmpresa])->orderBy('ano')->all();
---
SELECT `ano` FROM `analise` WHERE `idEmpresa`=5

</div> </div>
    <div class="tab-content">
        <?php
                        $analisesanos = Analise::find()->select('*')->where(['idEmpresa' => $model->idEmpresa])->all();
---
SELECT `ano` FROM `analise` WHERE `idEmpresa`=5

                    </thead>
                    <tbody>
                    <?php
                    $analises = Analise::find()->select('texto')->where(['ano' => $analiseano->ano])->andWhere(['idEmpresa' => $model->idEmpresa])->all();
---
SELECT `texto` FROM `analise` WHERE (`ano`=2015) AND (`idEmpresa`=5)