views/indice/_form.php

SELECT * FROM `tipo_indice`
---
<div class="indice-form">

    <?php
        $indices = TipoIndice::find()->select('*')->all();