controllers/EmpresaController.php

SELECT * FROM `conta`
---

        	 }
        }
        $contas = Conta::find()->select('*')->all();

SELECT DISTINCT `ano` FROM `empresa_conta` ORDER BY `ano`
---

        }

        $anosEmpresas = EmpresaConta::find()->select('ano')->distinct()->orderBy(["ano"=> SORT_ASC])->all();