controllers/IndiceController.php

INSERT INTO `indice` (`nomeIndice`, `idTipo_Indice`, `formula`) VALUES ('Teste Cadastro123', 1, '#AT@-@#AC')
---
    public function actionCreate()
    {
        $model = new Indice();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {