models/Analise.php

    public function getNotification(){
    	$query = Analise::find()->where(['status' => '2'])->count();
---
SELECT COUNT(*) FROM `analise` WHERE `status`='2'