models/Notificacao.php

    public function getNotification(){

    	$id = Yii::$app->user->getId();

    	$query = Notificacao::find()->where(['Usuario_idUsuario' => $id])->count();
        $query = Notificacao::find()->where(['idAnalise' => $id])->count();
---
SELECT COUNT(*) FROM `notificacao` WHERE `Usuario_idUsuario`=1
SELECT COUNT(*) FROM `notificacao` WHERE `idAnalise`=1