models/User.php

SELECT * FROM `usuario` WHERE `idUsuario`=3
---
	public static function findIdentity($id) {
		$Usuario = Usuario::find()
		->where([
				"idUsuario" => $id
		])
		->one();

SELECT * FROM `usuario` WHERE `login`='Gisa'
---
	public static function findByLogin($login) {
		$Usuario = Usuario::find()
		->where([
				"login" => $login
		])
		->one();