models/Usuario.php

    public function getNotification(){
    	$query = Usuario::find()->where(['ativo' => '2'])->count();
---
SELECT COUNT(*) FROM `usuario` WHERE `ativo`='2'